src/Misc/MiscNotes/AircrackAndMinidwep.org
#+SETUPFILE: ~/.emacs.d/src/org-templates/level-2.org
#+TITLE: Aircrack-ng and Minidwep-gtk
#+OPTIONS: num:nil H:2


* Aircrack-ng
Aircrack-ng是一款用于破解无线802.11WEP及WPA-PSK加密的工具，该工具在
2005年11月之前名字是Aircrack，在其2.41版本之后才改名为Aircrack-ng。

Aircrack-ng主要使用了两种攻击方式进行WEP破解：一种是FMS攻击，该攻击方
式是以发现该WEP漏洞的研究人员名字（Scott Fluhrer、Itsik Mantin及Adi
Shamir）所命名；另一种是KoreK攻击，经统计，该攻击方式的攻击效率要远高
于FMS攻击。当然，最新的版本又集成了更多种类型的攻击方式。

+ aircrack-ng: 主要用于WEP及WPA-PSK密码的恢复，只要airodump-ng收集到足
  够数量的数据包，aircrack-ng就可以自动检测数据包并判断是否可以破解
+ airmon-ng: 用于改变无线网卡工作模式，以便其他工具的顺利使用
+ airodump-ng: 用于捕获802.11数据报文，以便于aircrack-ng破解
+ aireplay-ng: 在进行WEP及WPA-PSK密码恢复时，可以根据需要创建特殊的无
  线网络数据报文及流量
+ airserv-ng: 可以将无线网卡连接至某一特定端口，为攻击时灵活调用做准备
+ airolib-ng: 进行WPA Rainbow Table攻击时使用，用于建立特定数据库文件
+ airdecap-ng: 用于解开处于加密状态的数据包
+ tools: 其他用于辅助的工具，如airdriver-ng、packetforge-ng等

recommend anything with an RTL8187L chip or RT3070 chip or compatible
device.

+ [[http://dishingtech.blogspot.hk/2012/03/backtrack-v-beini-hacking-wifi-easy-way.html][BackTrack outdated]]
+ [[http://dishingtech.blogspot.hk/2012/05/beini-alternative-xiaopan-041-is-better.html][Xiaopan OS & It's Better]]
+ [[http://blog.sina.com.cn/s/blog_6751e16f0100hurh.html][命令行下无线破解wep，破解隐藏ESSID]]
+ [[http://netsecurity.51cto.com/art/201105/264844_all.htm][完全教程 Aircrack-ng破解WEP、WPA-PSK加密利器]]

* Minidwep-gtk
minidwepgtk 獲取握手包並使用自帶的字典破解

** ewsa (Elcomsoft Wireless Security Auditor) 工具
ElcomSoft 是一家俄羅斯軟體公司，出品過不少密碼破解軟體，涉及 Office、
SQL、PDF、EFS 等等。ElcomSoft 又推出了「Wireless Security Auditor
」，號稱可以利用 GPU 的運算性能快速攻破無線網絡密碼，運算速度相比使用
CPU 可提高最多上百倍。

1. 點導入數據→導入 AP 目標數據文件
2. 點選項→新建字典選項
3. 選擇要暴力破解的「握手包」並點開始攻擊

** More
+ [[https://read01.com/ggn4y0.html][Minidwep-gtk 图形化操作]]
+ [[http://www.kali.org.cn/thread-14648-1-1.html][minidwep-gtk-40420支持乱枪扫射，自动PIN]]
+ [[http://prog3.com/sbdm/blog/hackerwin7/article/details/42005771][Ubuntu aircrack-ng, Reaver minidwep-gtk 14.04 installation]]

* cc

#+begin_src sh

#+end_src
