public_html/Misc/MiscNotes/AircrackAndMinidwep.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Aircrack-ng and Minidwep-gtk</title>
<!-- 2017-05-04 Thu 22:12 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Shi Shougang" />
<link href="../../assets/bootstrap.min.css" rel="stylesheet" media="screen">
<link href="../../assets/bootstrap-responsive.min.css" rel="stylesheet">
<link rel="stylesheet" type="text/css" href="../../assets/stylesheet.css" />
</head>
<body>
<div id="content">
<h1 class="title">Aircrack-ng and Minidwep-gtk</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Aircrack-ng</a></li>
<li><a href="#sec-2">Minidwep-gtk</a>
<ul>
<li><a href="#sec-2-1">ewsa (Elcomsoft Wireless Security Auditor) 工具</a></li>
<li><a href="#sec-2-2">More</a></li>
</ul>
</li>
<li><a href="#sec-3">cc</a></li>
</ul>
</div>
</div>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Aircrack-ng</h2>
<div class="outline-text-2" id="text-1">
<p>
Aircrack-ng是一款用于破解无线802.11WEP及WPA-PSK加密的工具，该工具在
2005年11月之前名字是Aircrack，在其2.41版本之后才改名为Aircrack-ng。
</p>

<p>
Aircrack-ng主要使用了两种攻击方式进行WEP破解：一种是FMS攻击，该攻击方式是以发现该WEP漏洞的研究人员名字（Scott Fluhrer、Itsik Mantin及Adi
Shamir）所命名；另一种是KoreK攻击，经统计，该攻击方式的攻击效率要远高于FMS攻击。当然，最新的版本又集成了更多种类型的攻击方式。
</p>

<ul class="org-ul">
<li>aircrack-ng: 主要用于WEP及WPA-PSK密码的恢复，只要airodump-ng收集到足够数量的数据包，aircrack-ng就可以自动检测数据包并判断是否可以破解
</li>
<li>airmon-ng: 用于改变无线网卡工作模式，以便其他工具的顺利使用
</li>
<li>airodump-ng: 用于捕获802.11数据报文，以便于aircrack-ng破解
</li>
<li>aireplay-ng: 在进行WEP及WPA-PSK密码恢复时，可以根据需要创建特殊的无线网络数据报文及流量
</li>
<li>airserv-ng: 可以将无线网卡连接至某一特定端口，为攻击时灵活调用做准备
</li>
<li>airolib-ng: 进行WPA Rainbow Table攻击时使用，用于建立特定数据库文件
</li>
<li>airdecap-ng: 用于解开处于加密状态的数据包
</li>
<li>tools: 其他用于辅助的工具，如airdriver-ng、packetforge-ng等
</li>
</ul>

<p>
recommend anything with an RTL8187L chip or RT3070 chip or compatible
device.
</p>

<ul class="org-ul">
<li><a href="http://dishingtech.blogspot.hk/2012/03/backtrack-v-beini-hacking-wifi-easy-way.html">BackTrack outdated</a>
</li>
<li><a href="http://dishingtech.blogspot.hk/2012/05/beini-alternative-xiaopan-041-is-better.html">Xiaopan OS &amp; It's Better</a>
</li>
<li><a href="http://blog.sina.com.cn/s/blog_6751e16f0100hurh.html">命令行下无线破解wep，破解隐藏ESSID</a>
</li>
<li><a href="http://netsecurity.51cto.com/art/201105/264844_all.htm">完全教程 Aircrack-ng破解WEP、WPA-PSK加密利器</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Minidwep-gtk</h2>
<div class="outline-text-2" id="text-2">
<p>
minidwepgtk 獲取握手包並使用自帶的字典破解
</p>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">ewsa (Elcomsoft Wireless Security Auditor) 工具</h3>
<div class="outline-text-3" id="text-2-1">
<p>
ElcomSoft 是一家俄羅斯軟體公司，出品過不少密碼破解軟體，涉及 Office、
SQL、PDF、EFS 等等。ElcomSoft 又推出了「Wireless Security Auditor
」，號稱可以利用 GPU 的運算性能快速攻破無線網絡密碼，運算速度相比使用
CPU 可提高最多上百倍。
</p>

<ol class="org-ol">
<li>點導入數據→導入 AP 目標數據文件
</li>
<li>點選項→新建字典選項
</li>
<li>選擇要暴力破解的「握手包」並點開始攻擊
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">More</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li><a href="https://read01.com/ggn4y0.html">Minidwep-gtk 图形化操作</a>
</li>
<li><a href="http://www.kali.org.cn/thread-14648-1-1.html">minidwep-gtk-40420支持乱枪扫射，自动PIN</a>
</li>
<li><a href="http://prog3.com/sbdm/blog/hackerwin7/article/details/42005771">Ubuntu aircrack-ng, Reaver minidwep-gtk 14.04 installation</a>
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">cc</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">

<pre class="src src-sh"></pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Shi Shougang</p>
<p class="date">Created: 2017-05-04 Thu 22:12</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
